id is the primary key (column with unique values) for this table. It is guaranteed that department name is not NULL.
Each row of this table indicates the ID of a department and its name.



Write a solution to find employees who have the highest salary in each of the departments.

In [1]:
import pandas as pd

In [32]:
employees_data = pd.read_csv('employees.csv', header=0)
department_data = pd.read_csv('department.csv', header=0)
print('employee data', employees_data)
print('department data', department_data)

employee data    id   name  salary  departmentId
0   1   Joe    70000             1
1   2   Jim    90000             1
2   3  Henry   80000             2
3   4   Sam    60000             2
4   5   Max    90000             1
department data    id   name
0   1     IT
1   2  Sales

In [27]:
merged_df = pd.merge(employees_data, department_data, left_on='departmentId', right_on='id')
merged_df

   id_x name_x  salary  departmentId  id_y name_y
0     1   Joe    70000             1     1     IT
1     2   Jim    90000             1     1     IT
2     5   Max    90000             1     1     IT
3     3  Henry   80000             2     2  Sales
4     4   Sam    60000             2     2  Sales

In [31]:
result_df = merged_df.sort_values(['departmentId', 'salary'], ascending=[True, False]).groupby('departmentId')
result_df.head(1).rename(columns={'name_x': 'Employee', 'salary': 'Salary', 'name_y': 'Department'}).reset_index(drop=True)

   <built-in function id> Employee  Salary  departmentId Department
0                       2     Jim    90000             1         IT
1                       3    Henry   80000             2      Sales

In [37]:
def department_highest_salary(employee: pd.DataFrame, department: pd.DataFrame) -> pd.DataFrame:
    merged_df = pd.merge(employee, department, left_on='departmentId', right_on='id')
    result_df = merged_df.sort_values(['departmentId','salary'], ascending=[True, False]).groupby('departmentId').apply(lambda x:x[x['salary'] == x['salary'].max()]).rename(columns={'name_x': 'Employee', 'salary':'Salary', 'name_y':'Department'}).reset_index(drop=True)
    return result_df[['Department','Employee', 'Salary']]

In [38]:
department_highest_salary(employees_data, department_data)

  Department Employee  Salary
0         IT     Jim    90000
1         IT     Max    90000
2      Sales    Henry   80000